{"details":{"nickname":"FARHAN","name":"Farhan Septiansyah Hidayat","about_me":"Selama masa pendidikan, saya bekerja sebagai sales dan menjadi bagian dari tim penjualan berbagai produk mulai dari pakaian hingga ponsel pintar. Ketertarikan saya pada teknologi tumbuh sejak kecil, terutama dari dunia aviasi yang menekankan ketelitian dan prosedur. Namun, keterbatasan ekonomi membuat saya mencari alternatif lain di luar dunia aviasi, seperti produksi musik dengan DAW hingga penggunaan alat otomasi seperti macro dan coding. Dari sinilah saya mulai mengeksplorasi dunia data dan IT secara lebih mendalam."},"skills":{"title":"KETERAMPILAN","detail":[{"title":"Bahasa Pemrograman","tools":"HTML, CSS, JavaScript, PHP","description":"Bahasa pemrograman yang sering saya gunakan dalam pengembangan frontend dan backend adalah JavaScript dan PHP. Saat ini, saya juga sedang mempelajari bahasa lain seperti Java dan Rust."},{"title":"Framework","tools":"Node.js, React.js, Vue.js, Laravel","description":"Framework yang sering saya gunakan untuk pengembangan frontend adalah React.js, Vue.js, dan Next.js. Untuk backend, saya menggunakan Laravel dan NestJS."},{"title":"Lain-lain","tools":"Microsoft Excel, Tableau, Adobe Photoshop, Adobe Illustrator, Adobe Premiere Pro","description":"Saya mahir menggunakan Excel, mulai dari penggunaan formula hingga macro. Selain itu, saya memiliki kemampuan dalam desain dan motion graphic, serta telah mengembangkan keahlian saya dengan menguasai alat analisis seperti Tableau."}]},"careers":{"title":"KARIR","detail":[{"title":"Teknologi","year":"2024 - Sekarang","description":"Setelah merasa cukup siap dengan ilmu yang saya pelajari, saya mulai terjun ke dunia teknologi. Pengalaman ini mengasah kemampuan saya di bidang pengembangan web, dan saat ini saya sedang fokus mendalami pengembangan aplikasi mobile."},{"title":"Perusahaan Minyak & Gas","year":"2022 - 2024","description":"Di bidang ini, saya belajar menangani korespondensi resmi dan memastikan bahwa setiap tugas dilakukan sesuai dengan prosedur yang berlaku."},{"title":"Event Organizer","year":"2021","description":"Bekerja di bidang event memicu kreativitas saya. Pekerjaan ini menjadi batu loncatan untuk memahami cara mengolah data dan bernegosiasi."},{"title":"Ritel","year":"2017 - 2020","description":"Ritel merupakan pekerjaan yang mudah diakses oleh lulusan baru. Di sini saya belajar bekerja dalam tim dan berorientasi pada target."}]},"strengths":{"title":"KEKUATAN","detail":[{"title":"Sangat Termotivasi dan Cepat Belajar","description":"Saya adalah individu yang sangat termotivasi dan memiliki semangat belajar yang tinggi. Bagi saya, belajar bukan hanya kebutuhan, tetapi juga aktivitas yang menyenangkan yang mendorong rasa ingin tahu dan pertumbuhan pribadi. Setiap pengalaman baru saya jalani dengan ketertarikan yang tulus, bukan sekadar kewajiban."},{"title":"Pemecah Masalah Strategis","description":"Saya memandang pemecahan masalah seperti menyusun teka-teki yang kompleks—menantang namun memuaskan. Pola pikir analitis saya membantu dalam menghadapi tantangan secara metodis dan menemukan solusi yang efektif, baik di pekerjaan maupun kehidupan pribadi dan sosial."},{"title":"Kreatif dan Proaktif","description":"Kreativitas adalah bagian dari diri saya, dipengaruhi oleh orang tua yang merupakan dosen musik dan musisi di kota Medan. Keterlibatan dalam musik dan seni telah mempertajam kemampuan saya untuk berpikir di luar kebiasaan, serta menciptakan sesuatu dari sudut pandang yang unik."}]},"futures":{"title":"MASA DEPAN","detail":[{"title":"Tiga Tahun ke Depan","description":"Dalam tiga tahun ke depan, setelah bergabung dengan perusahaan Anda, saya berharap menjadi seorang pemimpin tim kecil yang mendorong profitabilitas perusahaan melalui kebijakan yang efektif. Kepemimpinan bukan hanya tentang memberi perintah, tetapi juga memberi contoh, menginspirasi, dan menjadi panutan bagi karyawan baru maupun yang sudah ada."},{"title":"Lima Tahun ke Depan","description":"Dalam lima tahun ke depan, saya ingin menjadi bagian penting dalam perusahaan Anda, dengan keahlian yang tidak hanya mencakup manajemen, tetapi juga implementasi teknis yang selaras dengan kebutuhan operasional perusahaan."}]}}